app/controllers/users_controller.rb

INSERT INTO "users" ("name", "created_at", "updated_at", "picture_content_type", "picture_updated_at", "picture_file_name", "picture_file_size") VALUES('mike', '2010-06-29 22:40:59', '2010-06-29 22:40:59', NULL, NULL, NULL, NULL)
---
  def create
    @user = User.new(params[:user])

    if @user.save

SELECT * FROM "users" WHERE ("users"."id" = 2)
---
  def update
    @user = User.find(params[:id])